
                           Design Compiler Graphical 
                                 DC Ultra (TM)
                                  DFTMAX (TM)
                              Power Compiler (TM)
                                 DesignWare (R)
                                 DC Expert (TM)
                               Design Vision (TM)
                               HDL Compiler (TM)
                               VHDL Compiler (TM)
                                  DFT Compiler
                               Design Compiler(R)

               Version R-2020.09-SP2 for linux64 - Dec 03, 2020 

                    Copyright (c) 1988 - 2020 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.
Initializing...
Initializing gui preferences from file  /home/s267517/.synopsys_dc_gui/preferences.tcl
##################### RI5CY SCAN INSERTION with LBIST  ##########################################
#################################################################################################
set GATE_PATH			../output
../output
set REPORT_PATH			../rpt
../rpt
set LOG_PATH			../log
../log
set TECH 			NangateOpenCell
NangateOpenCell
set TOPLEVEL			riscv_core
riscv_core
set search_path [ join "../techlib/ $search_path" ]
../techlib/ . /eda/synopsys/2020-21/RHELx86/SYN_2020.09-SP2/libraries/syn /eda/synopsys/2020-21/RHELx86/SYN_2020.09-SP2/dw/syn_ver /eda/synopsys/2020-21/RHELx86/SYN_2020.09-SP2/dw/sim_ver
set search_path [ join "$GATE_PATH $search_path" ]
../output ../techlib/ . /eda/synopsys/2020-21/RHELx86/SYN_2020.09-SP2/libraries/syn /eda/synopsys/2020-21/RHELx86/SYN_2020.09-SP2/dw/syn_ver /eda/synopsys/2020-21/RHELx86/SYN_2020.09-SP2/dw/sim_ver
source ../bin/$TECH.dc_setup_scan.tcl
Loading db file '/home/s267517/assignment/riscv/gate/scan/syn/techlib/NangateOpenCellLibrary_typical_ccs_scan.db'
Information: Using CCS timing libraries. (TIM-024)
Loading db file '/eda/synopsys/2020-21/RHELx86/SYN_2020.09-SP2/libraries/syn/gtech.db'
Loading db file '/eda/synopsys/2020-21/RHELx86/SYN_2020.09-SP2/libraries/syn/standard.sldb'
  Loading link library 'gtech'
Loading db file '/home/s267517/assignment/riscv/gate/scan/syn/techlib/NangateOpenCellLibrary_typical_ccs_scan.db'
Warning: Overwriting design file '/home/s267517/assignment/riscv/gate/scan/syn/techlib/NangateOpenCellLibrary_typical_ccs_scan.db'. (DDB-24)
Loaded 0 designs.
read_ddc {$TOPLEVEL}_scan.ddc
Error: extra characters after close-brace
	Use error_info for more info. (CMD-013)
analyze -format vhdl -work work ../../../../rtl/lbist_blocks/mux2to1.vhd
Running PRESTO HDLC
Compiling Entity Declaration MUX2TO1_N
Compiling Architecture BHV of MUX2TO1_N
Presto compilation completed successfully.
1
analyze -format vhdl -work work ../../../../rtl/lbist_blocks/bist_controller.vhd
Running PRESTO HDLC
Compiling Entity Declaration BIST_CONTROLLER
Compiling Architecture BHV of BIST_CONTROLLER
Presto compilation completed successfully.
1
analyze -format verilog -work work ../../../../rtl/lbist_blocks/tpg/lfsr/lfsr.v
Running PRESTO HDLC
Compiling source file ../../../../rtl/lbist_blocks/tpg/lfsr/lfsr.v
Warning:  ../../../../rtl/lbist_blocks/tpg/lfsr/lfsr.v:39: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/tpg/lfsr/lfsr.v:39: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/tpg/lfsr/lfsr.v:39: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/tpg/lfsr/lfsr.v:39: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/tpg/lfsr/lfsr.v:39: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/tpg/lfsr/lfsr.v:74: The statements in initial blocks are ignored. (VER-281)
Presto compilation completed successfully.
1
analyze -format verilog -work work ../../../../rtl/lbist_blocks/tpg/phase_shifter/phase_shifter.v
Running PRESTO HDLC
Compiling source file ../../../../rtl/lbist_blocks/tpg/phase_shifter/phase_shifter.v
Warning:  ../../../../rtl/lbist_blocks/tpg/phase_shifter/phase_shifter.v:31: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/tpg/phase_shifter/phase_shifter.v:46: A unnamed generate block with an LRM-defined name 'genblk2' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Presto compilation completed successfully.
1
analyze -format vhdl -work work ../../../../rtl/lbist_blocks/test_counter/counter.vhd
Running PRESTO HDLC
Compiling Entity Declaration COUNTER
Compiling Architecture BEH of COUNTER
Presto compilation completed successfully.
1
analyze -format vhdl -work work ../../../../rtl/lbist_blocks/test_counter/test_counter.vhd
Running PRESTO HDLC
Compiling Entity Declaration TEST_COUNTER
Compiling Architecture STRUCTURE of TEST_COUNTER
Presto compilation completed successfully.
1
analyze -format verilog -work work ../../../../rtl/lbist_blocks/out_eval/misr.v
Running PRESTO HDLC
Compiling source file ../../../../rtl/lbist_blocks/out_eval/misr.v
Warning:  ../../../../rtl/lbist_blocks/out_eval/misr.v:40: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/out_eval/misr.v:40: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/out_eval/misr.v:39: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/out_eval/misr.v:48: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/out_eval/misr.v:48: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/out_eval/misr.v:47: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/out_eval/misr.v:36: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/out_eval/misr.v:36: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/out_eval/misr.v:36: A unnamed generate block with an LRM-defined name 'genblk1' is detected, which is incompatible with Verilog standard 2001 or 1995. (VER-944)
Warning:  ../../../../rtl/lbist_blocks/out_eval/misr.v:56: The statements in initial blocks are ignored. (VER-281)
Presto compilation completed successfully.
1
analyze -format vhdl -work work ../../../../rtl/lbist_blocks/out_eval/out_eval.vhd
Running PRESTO HDLC
Compiling Entity Declaration OUTPUT_EVALUATOR
Compiling Architecture STRUCTURE of OUTPUT_EVALUATOR
Presto compilation completed successfully.
1
analyze -format vhdl -work work ../../../../rtl/lbist_blocks/lbist_wrapper.vhd
Running PRESTO HDLC
Compiling Entity Declaration RISCV_LBIST
Compiling Architecture STRUCTURE of RISCV_LBIST
Presto compilation completed successfully.
1
analyze -format sverilog -work work ../../../../tb/riscv_wrapper_gate_lbist.sv
Running PRESTO HDLC
Compiling source file ../../../../tb/riscv_wrapper_gate_lbist.sv
Error:  Unable to open file `../../../../tb/riscv_wrapper_gate_lbist.sv': No such file or directory. (VER-41)
*** Presto compilation terminated with 1 errors. ***
0
#current_design 
#link
#check_design
#compile
#write -hierarchy -format verilog -output "${GATE_PATH}/${TOPLEVEL}_lbist.v"
#write_sdf -version 3.0 "${GATE_PATH}/${TOPLEVEL}_lbist.sdf"
#write_sdc "${GATE_PATH}/${TOPLEVEL}_lbist.sdc"
#quit
dc_shell> analyze e -format svw[Kerilog ../
./       ../      bin/     log/     output/  rpt/     run/     techlib/ 
dc_shell> analyze -format sverilog ../
./       ../      bin/     log/     output/  rpt/     run/     techlib/ 
dc_shell> analyze -format sverilog ../[K[K[K-work work ../../../
./                          NangateOpenCellLibrary.tlib bist/                       scan/                       
../                         NangateOpenCellLibrary.v    riscv_core.v                v1/                         
dc_shell> analyze -format sverilog -work work ../../../
./                          NangateOpenCellLibrary.tlib bist/                       scan/                       
../                         NangateOpenCellLibrary.v    riscv_core.v                v1/                         
dc_shell> analyze -format sverilog -work work ../../../../
./                         clean_all.sh               gate/                      run_rtl_gui.sh             tmax.tcl                   
../                        compile_sbst.sh            rtl/                       run_rtl_nogui.sh           vsim.tcl                   
Bender.yml                 compile_testbench.sh       run/                       sbst/                      
LICENSE                    compile_testbench_lbist.sh run_fsim.sh                src_files.yml              
README.md                  doc/                       run_gate_gui.sh            tb/                        
ci/                        fix_evcd.sh                run_gate_nogui.sh          test/                      
dc_shell> analyze -format sverilog -work work ../../../../
./                         clean_all.sh               gate/                      run_rtl_gui.sh             tmax.tcl                   
../                        compile_sbst.sh            rtl/                       run_rtl_nogui.sh           vsim.tcl                   
Bender.yml                 compile_testbench.sh       run/                       sbst/                      
LICENSE                    compile_testbench_lbist.sh run_fsim.sh                src_files.yml              
README.md                  doc/                       run_gate_gui.sh            tb/                        
ci/                        fix_evcd.sh                run_gate_nogui.sh          test/                      
dc_shell> analyze -format sverilog -work work ../../../../t
tb/      test/    tmax.tcl 
dc_shell> analyze -format sverilog -work work ../../../../tb/r[Kcore/r
riscv_compliance_tests/     riscv_wrapper.sv            riscv_wrapper_gate_lbist.sv 
riscv_tests/                riscv_wrapper_gate.sv       
dc_shell> analyze -format sverilog -work work ../../../../tb/core/riscv_i[Kw
riscv_wrapper.sv            riscv_wrapper_gate.sv       riscv_wrapper_gate_lbist.sv 
dc_shell> analyze -format sverilog -work work ../../../../tb/core/riscv_wrapperg[K_
riscv_wrapper_gate.sv       riscv_wrapper_gate_lbist.sv 
dc_shell> analyze -format sverilog -work work ../../../../tb/core/riscv_wrapper_gatel[K_lbist.sv [K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kanalyze -forma[Kat vhd l ../../../../r
rtl/              run/              run_fsim.sh       run_gate_gui.sh   run_gate_nogui.sh run_rtl_gui.sh    run_rtl_nogui.sh  
dc_shell> analyze -format vhdl ../../../../rtl/r
register_file_test_wrap.sv   riscv_controller.sv          riscv_hwloop_regs.sv         riscv_prefetch_L0_buffer.sv  
riscv_L0_buffer.sv           riscv_core.sv                riscv_id_stage.sv            riscv_prefetch_buffer.sv     
riscv_alu.sv                 riscv_cs_registers.sv        riscv_if_stage.sv            riscv_register_file.sv       
riscv_alu_basic.sv           riscv_decoder.sv             riscv_int_controller.sv      riscv_register_file_latch.sv 
riscv_alu_div.sv             riscv_ex_stage.sv            riscv_load_store_unit.sv     riscv_scan_core_lbist.vhd    
riscv_apu_disp.sv            riscv_fetch_fifo.sv          riscv_mult.sv                riscv_tracer.sv              
riscv_compressed_decoder.sv  riscv_hwloop_controller.sv   riscv_pmp.sv                 
dc_shell> analyze -format vhdl ../../../../rtl/ri
riscv_L0_buffer.sv           riscv_core.sv                riscv_id_stage.sv            riscv_prefetch_buffer.sv     
riscv_alu.sv                 riscv_cs_registers.sv        riscv_if_stage.sv            riscv_register_file.sv       
riscv_alu_basic.sv           riscv_decoder.sv             riscv_int_controller.sv      riscv_register_file_latch.sv 
riscv_alu_div.sv             riscv_ex_stage.sv            riscv_load_store_unit.sv     riscv_scan_core_lbist.vhd    
riscv_apu_disp.sv            riscv_fetch_fifo.sv          riscv_mult.sv                riscv_tracer.sv              
riscv_compressed_decoder.sv  riscv_hwloop_controller.sv   riscv_pmp.sv                 
riscv_controller.sv          riscv_hwloop_regs.sv         riscv_prefetch_L0_buffer.sv  
dc_shell> analyze -format vhdl ../../../../rtl/riscv_scan_core_lbist.vhd 
Running PRESTO HDLC
Compiling Entity Declaration RISCV_CORE
Compiling Architecture STRUCTURE of RISCV_CORE
Presto compilation completed successfully.
1
dc_shell> current_design
Error: Current design is not defined. (UID-4)
dc_shell> elaborate
Error: Required argument 'design_name' was not found (CMD-007)
dc_shell> current_design riscv_core
Error: Can't find design 'riscv_core'. (UID-109)
Error: Current design is not defined. (UID-4)
dc_shell> current_design riscv_core[25D[Kelaborate riscv_core -work work
Running PRESTO HDLC
Warning:  ../../../../rtl/riscv_scan_core_lbist.vhd:107: Floating pin 'pis[266] of cell lbist' connected to ground. (ELAB-294)
Warning:  ../../../../rtl/riscv_scan_core_lbist.vhd:107: Floating pin 'pis[265] of cell lbist' connected to ground. (ELAB-294)
Warning:  ../../../../rtl/riscv_scan_core_lbist.vhd:107: Floating pin 'pis[264] of cell lbist' connected to ground. (ELAB-294)
Warning:  ../../../../rtl/riscv_scan_core_lbist.vhd:107: Floating pin 'pis[263] of cell lbist' connected to ground. (ELAB-294)
Presto compilation completed successfully. (riscv_core)
Elaborated 1 design.
Current design is now 'riscv_core'.
Information: Building the design 'riscv_lbist'. (HDL-193)
Presto compilation completed successfully. (riscv_lbist)
Information: Building the design 'riscv_core_0_128_1_16_1_1_0_0_0_0_0_0_0_0_0_3_6_15_5_1a110800'. (HDL-193)
Warning: Cannot find the design 'riscv_core_0_128_1_16_1_1_0_0_0_0_0_0_0_0_0_3_6_15_5_1a110800' in the library 'WORK'. (LBR-1)
Information: Building the design 'mux2to1_n' instantiated from design 'riscv_lbist' with
	the parameters "N=267". (HDL-193)
Presto compilation completed successfully. (mux2to1_n_N267)
Information: Building the design 'lfsr' instantiated from design 'riscv_lbist' with
	the parameters "N=24,SEED=1". (HDL-193)
Error:  ../../../../rtl/lbist_blocks/tpg/lfsr/lfsr.v:34: Clock clk used as data. (ELAB-305)
*** Presto compilation terminated with 1 errors. ***
Information: Building the design 'lfsr' instantiated from design 'riscv_lbist' with
	the parameters "N=24,SEED=1". (HDL-193)
Information: Building the design 'phase_shifter' instantiated from design 'riscv_lbist' with
	the parameters "N_IN=24,N_OUT=267". (HDL-193)
Presto compilation completed successfully. (phase_shifter_N_IN24_N_OUT267)
Information: Building the design 'bist_controller'. (HDL-193)
Warning:  ../../../../rtl/lbist_blocks/bist_controller.vhd:37: The initial value for signal 'CURRENT_STATE' is not supported for synthesis. Presto ignores it.  (ELAB-130)
Warning:  ../../../../rtl/lbist_blocks/bist_controller.vhd:38: The initial value for signal 'NEXT_STATE' is not supported for synthesis. Presto ignores it.  (ELAB-130)

Statistics for case statements in always block at line 55 in file
	'../../../../rtl/lbist_blocks/bist_controller.vhd'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            57            |    auto/auto     |
===============================================

Statistics for case statements in always block at line 92 in file
	'../../../../rtl/lbist_blocks/bist_controller.vhd'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            94            |    auto/auto     |
===============================================

Inferred memory devices in process
	in routine bist_controller line 44 in file
		'../../../../rtl/lbist_blocks/bist_controller.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     go_nogo_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|  CURRENT_STATE_reg  | Flip-flop |   3   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully. (bist_controller)
Information: Building the design 'test_counter' instantiated from design 'riscv_lbist' with
	the parameters "TEST_DURATION=11100,TEST_START=98". (HDL-193)
Presto compilation completed successfully. (test_counter_TEST_DURATION11100_TEST_START98)
Information: Building the design 'output_evaluator' instantiated from design 'riscv_lbist' with
	the parameters "N=239". (HDL-193)
Presto compilation completed successfully. (output_evaluator_N239)
Information: Building the design 'counter' instantiated from design 'test_counter_TEST_DURATION11100_TEST_START98' with
	the parameters "N=24,RST_VALUE=0". (HDL-193)

Inferred memory devices in process
	in routine counter_N24_RST_VALUE0 line 27 in file
		'../../../../rtl/lbist_blocks/test_counter/counter.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|       tmp_reg       | Flip-flop |  24   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully. (counter_N24_RST_VALUE0)
Information: Building the design 'misr' instantiated from design 'output_evaluator_N239' with
	the parameters "N=24,SEED=1". (HDL-193)
Error:  ../../../../rtl/lbist_blocks/out_eval/misr.v:28: Clock clk used as data. (ELAB-305)
*** Presto compilation terminated with 1 errors. ***
Information: Building the design 'misr' instantiated from design 'output_evaluator_N239' with
	the parameters "N=24,SEED=1". (HDL-193)
Warning: Design 'riscv_core' has '3' unresolved references. For more detailed information, use the "link" command. (UID-341)
1
dc_shell> current _design
Current design is 'riscv_core'.
{riscv_core}
dc_shell> link

  Linking design 'riscv_core'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  NangateOpenCellLibrary (library) /home/s267517/assignment/riscv/gate/scan/syn/techlib/NangateOpenCellLibrary_typical_ccs_scan.db

Information: Building the design 'riscv_core_0_128_1_16_1_1_0_0_0_0_0_0_0_0_0_3_6_15_5_1a110800'. (HDL-193)
Warning: Cannot find the design 'riscv_core_0_128_1_16_1_1_0_0_0_0_0_0_0_0_0_3_6_15_5_1a110800' in the library 'WORK'. (LBR-1)
Information: Building the design 'lfsr' instantiated from design 'riscv_lbist' with
	the parameters "N=24,SEED=1". (HDL-193)
Error:  ../../../../rtl/lbist_blocks/tpg/lfsr/lfsr.v:34: Clock clk used as data. (ELAB-305)
*** Presto compilation terminated with 1 errors. ***
Information: Building the design 'lfsr' instantiated from design 'riscv_lbist' with
	the parameters "N=24,SEED=1". (HDL-193)
Information: Building the design 'misr' instantiated from design 'output_evaluator_N239' with
	the parameters "N=24,SEED=1". (HDL-193)
Error:  ../../../../rtl/lbist_blocks/out_eval/misr.v:28: Clock clk used as data. (ELAB-305)
*** Presto compilation terminated with 1 errors. ***
Information: Building the design 'misr' instantiated from design 'output_evaluator_N239' with
	the parameters "N=24,SEED=1". (HDL-193)
Warning: Unable to resolve reference 'riscv_core_0_128_1_16_1_1_0_0_0_0_0_0_0_0_0_3_6_15_5_1a110800' in 'riscv_core'. (LINK-5)
Warning: Unable to resolve reference 'lfsr' in 'riscv_lbist'. (LINK-5)
Warning: Unable to resolve reference 'misr' in 'output_evaluator_N239'. (LINK-5)
0
dc_shell> exit

Memory usage for this session 140 Mbytes.
Memory usage for this session including child processes 140 Mbytes.
CPU usage for this session 6 seconds ( 0.00 hours ).
Elapsed time for this session 608 seconds ( 0.17 hours ).

Thank you...
